[
  {
    "noteId": 1,
    "holdingId": 70004106,
    "noteTitle": "Mgmt Meeting - 07/03/20",
    "region": "Europe",
    "country": "United Kingdom",
    "sector": "Health Care",
    "noteText": "AstraZeneca (NYSE:AZN) ranks as one of the top big drugmakers in terms of stock performance so far this year. That's not surprising, considering the company's solid quarterly updates and the positive publicity that it's garnered for its coronavirus vaccine program.\n\nBut is AstraZeneca stock a buy now? My answer is a resounding \"yes.\" Here are three key reasons why. 1. Multiple juggernaut franchises\nSome drugmakers specialize in one area where they really make their mark. AstraZeneca's success stems from not just one, but multiple juggernaut franchises. \n\nSales for AstraZeneca's oncology drugs continue to soar. Lung cancer drug Tagrisso now generates close to 16% of the company's total revenue. Imfinzi and Lynparza are picking up strong momentum, as is Calquence. Overall, AstraZeneca's oncology drugs delivered year-over-year sales growth of 26% in the first half of 2020.\n\nAstraZeneca is also a major player in cardiovascular, renal, and metabolism (CVRM) indications. Sales for diabetes drug Farxiga and blood thinner Brilinta are growing by double-digit percentages. The strength of these two blockbuster drugs is more than enough to offset sales declines for diabetes drugs Bydureon, Byetta, and Onglyza.\n\nThe company's respiratory and immunology franchise continues to deliver solid growth, as well. Respiratory drugs Symbicort and Fasenra are leading the way, with sales jumping 23% and 44%, respectively, in the first half of the year.\n\n2. A loaded pipeline\nWall Street analysts project that AstraZeneca will grow its earnings by an average annual rate of 19% over the next five years. The company's current lineup will fuel much of this growth. But AstraZeneca also boasts a pipeline loaded with potential winners.\n\nThe company has 166 programs in its pipeline. Close to two dozen of them are in phase 3 clinical studies. Many of these late-stage programs target additional indications for already-approved drugs, including Imfinzi and Lynparza. AstraZeneca also has new late-stage drug candidates, notably including roxadustat, which targets the treatment of anemia in chronic kidney disease, and tezepelumab in treating asthma.\n\nThere's one pipeline candidate that's understandably generating a lot of interest right now: investigational COVID-19 vaccine AZD1222. AstraZeneca teamed up with the University of Oxford earlier this year to develop the vaccine candidate. AZD1222 is now one of only a handful of COVID-19 vaccine candidates in late-stage testing. The company has lined up several high-dollar supply agreements, including a $1.2 billion deal with the U.S. government to supply up to 300 million doses.  3. Don't forget the dividend\nMegablockbuster franchises in oncology, CVRM, and respiratory and immunology combined with a deep and promising pipeline make this big pharma stock a good pick. But don't forget AstraZeneca's dividend yield of more than 2.5%.\n\nHow important is that dividend? Over the last 10 years, the total return of the stock has more than doubled its share-price appreciation thanks to the power of reinvested dividends.\n\nAny reasons for concern?\nAll stocks face risks. AstraZeneca isn't an exception. There's always a possibility that a pipeline candidate could flop in clinical testing. Current drugs could face increased competition. Some might also worry that AstraZeneca won't make much money from AZD1222 since the company has committed to supplying the coronavirus vaccine for no profit in Europe.\n\nHowever, my view is that AstraZeneca's opportunities far outweigh its risks. It's also important to note that the company could make a profit from AZD1222 once the COVID-19 pandemic is over. For investors looking for a relatively low-risk growth opportunity that offers an attractive dividend, AstraZeneca looks like a great pick.",
    "author": "Justin Machata",
    "comments": "author: JJ, comment: Justin - should we do a call with them to better understand the progress of their vaccine trails?\nauthor: JM, comment: Definitely.  I called my contact at Goldman to set something up"
  },
  {
    "noteId": 2,
    "holdingId": 70004106,
    "noteTitle": "COVID Update - 06/12/20",
    "region": "Europe",
    "country": "United Kingdom",
    "sector": "Health Care",
    "noteText": "The case for AstraZeneca\nAstraZeneca and the University of Oxford claim one of only six COVID-19 vaccine candidates in phase 3 testing. The two partners reported positive results from a phase 1 study of their investigational vaccine AZD1222 in July. \n\nAssuming the phase 3 testing of AZD1222 goes well, AstraZeneca will be quite busy shipping the vaccine across the world. The company has already lined up major supply deals with the U.S., U.K., France, Germany, Japan, Argentina, Mexico, and other countries.  \n\nBut AZD1222 isn't AstraZeneca's biggest opportunity. The company's oncology drugs generate roughly 40% of total revenue. Sales for two of those drugs, Imfinzi and Lynparza, continue to soar by more than 50% year over year. AstraZeneca's top-selling product, lung cancer drug Tagrisso, isn't too far behind with sales jumping 43% in the first half of 2020.\n\nHalf of AstraZeneca's 24 late-stage programs focus on treating cancer. Several of these programs target additional indications for approved cancer drugs such as Imfinzi and Lynparza. The company also has a couple of late-stage studies featuring new candidate capivasertib.\n\nAstraZeneca claims significant growth potential outside of oncology as well. In particular, the company appears to be in a strong position to expand its market share in the respiratory market with continued momentum for blockbuster Symbicort and two promising late-stage asthma candidates.\n\nBecause of its abundance of portfolio and pipeline riches, Wall Street analysts think that AstraZeneca will be able to deliver average annual earnings growth of 19% over the next five years. With the company's dividend yield of close to 2.5% thrown in, AstraZeneca should generate market-beating total returns.  My view is that AstraZeneca offers more diversification across products than Regeneron does. Its growth prospects appear to be somewhat better. The company pays an attractive dividend whereas Regeneron doesn't. It's also possible that success for AZD1222 and other COVID-19 vaccines could limit the market potential for antibody therapies such as Regeneron's REGN-COV2. ",
    "author": "Jonathan Joseph",
    "comments": ""
  },
  {
    "noteId": 3,
    "holdingId": 70004106,
    "noteTitle": "COVID Update - 07/01/20",
    "region": "Europe",
    "country": "United Kingdom",
    "sector": "Health Care",
    "noteText": "Clinical-stage biotech companies have hogged the limelight since the earliest days of the coronavirus vaccine race. Moderna (NASDAQ:MRNA), for example, grabbed everyone's attention when its vaccine candidate became the first to enter human trials in March. And then, a month later, a big pharma company made an important move -- one that launched it center stage.\n\nOn April 30, AstraZeneca (NYSE:AZN) announced its collaboration with the University of Oxford on the development and distribution of a vaccine candidate for COVID-19, the illness caused by the novel coronavirus. Researchers at Oxford had already been working on the potential vaccine and moved it into human testing when the partnership began. Now, some investors are wondering if AstraZeneca's position in the vaccine race may result in the triple-digit gains enjoyed by other biotech stocks this year -- like Moderna's 279% increase -- and possibly render AstraZeneca a millionaire-maker stock. Let's take a closer look. A strong future lineup \nAstraZeneca started the coronavirus vaccine race later than others. But thanks to the Oxford researchers' progress, the pharma company is now among the leaders from a timeline and data quality perspective. AstraZeneca is currently testing its candidate in a phase 3 study with 2,000 participants. Interim results from the earlier phases were positive. They showed that all participants who received two doses of the vaccine produced antibodies with the potential to neutralize the virus.\n\nWhile its progress is indisputable, AstraZeneca's shares haven't been extremely reactive to coronavirus vaccine news, in part because of its large size. Since the Oxford partnership announcement, its shares gained 7.2%. Before digging into share price gains, let's take a look at the rest of the company's work.\n\nAstraZeneca has 166 programs in the pipeline and boasts nine blockbuster drugs as oncological, cardiovascular, renal, metabolic, and respiratory therapies. In the first half of 2020, AstraZeneca reported growth in all of these areas. Revenue of the company's top-selling drug, Tagrisso, for advanced non-small cell lung cancer, climbed a staggering 43% in the half to more than $2 billion.\n\nDouble-digit sales growth\nOf AstraZeneca's 10 best-selling drugs, seven posted sales gains in the double digits for the first half. The results confirm what investors saw from AstraZeneca's annual performance. For the full year 2019, total revenue climbed 10% to $24 billion, and AstraZeneca reported double-digit revenue gains for half of the company's top sellers. These gains come in the face of generic competition, which has hurt sales of older drugs such as cholesterol blockbuster Crestor in recent years.\n\nNow, part of AstraZeneca's strategy is to generate revenue from its new medicines instead of relying on older products with slowing sales growth that have an increasing number of competitors. The plan is working. In the first half of 2020, new medicines accounted for half of total revenue, up from 40% in the year-earlier period. It's reasonable to expect annual revenue to continue the upward trend started last year if new medicines keep performing well. New indications for current drugs should also further support gains; AstraZeneca is planning about eight regulatory submissions for the second half and expects about a dozen regulatory decisions.\n\nAstraZeneca has recouped its market crash losses, gaining 49% since its lowest point in March. The stock is now up 12% so far this year. Shares have managed to climb over the past five years despite a few revenue stumbles, as older drugs like Crestor faced generic competition and newer drugs like Tagrisso had to pick up the slack. With revenue prospects  much better these days, I'm optimistic about future share performance. Could AstraZeneca make you a millionaire?\nSo, is AstraZeneca a millionaire-maker? Not in the same way as Moderna and shares of other clinical stage biotech companies that have skyrocketed this year. AstraZeneca, with a market value of $147 billion, can't double or triple in value as easily as a smaller player. Moderna, for instance, started the year with a market value of only $6 billion that has since grown to $27 billion.\n\nAstraZeneca probably won't make a lot of millionaires overnight, considering the massive investment required. Here's an example of AstraZeneca's millionaire-maker power versus that of Moderna from the start of the year to now. You would have had to invest $875,000 in AstraZeneca shares at the Dec. 31 market close to become a millionaire at today's share price. This figure doesn't include dividend payments. To be a Moderna millionaire today, you would have had to invest $260,813 at that time. \n\nWhile AstraZeneca may not offer the rapid share growth of some clinical stage biotech companies, it offers two things they don't: dividend payments and a consistently marketed line of products. AstraZeneca currently pays a dividend that totals $1.40 annually. Though the company hasn't increased the payment in recent years, it has consistently paid a dividend for more than 25 years. Dividends and revenue from popular products make AstraZeneca a safer bet than companies whose near-term revenue prospects may uniquely rely on the outcome of the coronavirus vaccine program. Considering those factors, long-term investors who believe in the pharmaceutical company today may reap the rewards in years to come.",
    "author": "Dave Meyers",
    "comments": "author: JJ, comment: Dave - can you dig into this so we can discuss at tomorrows meeting?\nauthor: DM, comment:  Justin, you have been doing some work on Moderna clinical trials.  Can we synch up?\nauthor: JM, comment: check out my note last Friday on my call with the Moderna CEO"
  },
  {
    "noteId": 4,
    "holdingId": 70002293,
    "noteTitle": "Earnings - 07/20/20",
    "region": "Asia",
    "country": "South Korea",
    "sector": "Information Technology",
    "noteText": "Samsung Electronics Announces Second Quarter 2020 Results.  Quarterly operating profit at KRW 8.15 trillion on sales of KRW 52.97 trillion\nReports solid earnings over higher memory demand, cost optimization\nExpects gradual recovery in demand for mobile and consumer electronics in H2\nSamsung Electronics reported today KRW 52.97 trillion in consolidated revenue and KRW 8.15 trillion in operating profit for the second quarter ended June 30, 2020.\n\n \n\nEven as the spread of COVID-19 caused closures and slowdowns at stores and production sites around the world, the Company responded to challenges through its extensive global supply chain, while minimizing the impact of the pandemic by strengthening online sales channels and optimizing costs.\n\n \n\nQuarterly operating profit rose 26 percent from the previous quarter and 23 percent from a year earlier, thanks to firm demand for memory chips and appliances, as well as a one-off gain at its Display Panel Business.\n\n \n\nA partial recovery in global demand since May also helped offset some COVID-19 effects, resulting in higher earnings than initially expected. Revenue in the quarter fell 4 percent from the previous quarter and 6 percent from a year earlier due to reduced sales of smartphones and other devices.\n\n \n\nEarnings from the Memory Business improved, led by solid demand from datacenters and PCs. However, slower demand for mobile memory resulted in weaker NAND bit growth compared to the market. System LSI reported lower earnings amid weakness in the mobile market while the Foundry Business saw a recovery in customer demand.\n\n \n\nIn the Display Panel Business, a one-off gain boosted profits from mobile displays while the Company saw losses from larger panels narrow slightly on increased sales of monitors.\n\n \n\nThe Mobile Communications Business reported solid profitability on marketing cost reductions and other cost optimizations, despite weaker sales of smartphones.\n\n \n\nThe Consumer Electronics Division posted higher earnings over growing sales of appliances such as air conditioners and dryers, as well as premium TVs including QLED models. HARMAN reported an operating loss amid deteriorating market conditions in the global auto industry.\n\n \n\nLooking ahead to the second half of 2020, Samsung Electronics expect a gradual recovery in demand for mobile devices and consumer electronics. While risks remain due to persisting uncertainties from COVID-19 and growing competitions, the Company will respond to reviving demand through flexible global supply chain management (SCM) to ensure stable supply to customers.\n\n \n\nFor the Memory Business, the Company expects demand for mobile and graphic memory to recover driven by new smartphones and game consoles. It will focus on flexible and timely management of product mix and investment to meet changing demand for each application.\n\n \n\nFor system semiconductors, the Company will focus on expanding sales of key products such as high-resolution sensors and 5G system-on-chips (SoCs).\n\n \n\nFor the Display Panel Business, a full-fledged rebound in earnings from mobile displays is expected in the fourth quarter, as a recovery in mobile phone demand during the third quarter will likely be limited to mid- and low-end models. For large-sized panels, the Company will accelerate development of quantum-dot (QD) displays as planned.\n\n \n\nThe Mobile Communications Business plans to unveil new flagship smartphones including the Galaxy Note and a foldable phone, while seeking to expand sales of mid-tier models. The smartphone market is expected to witness intensifying competition amid a gradual recovery in demand in the second half of the year.\n\n \n\nSamsung also aims to enhance profitability from the Consumer Electronics Division through sales of premium products, including QLED TVs and the Bespoke home appliance series, and more efficient marketing. HARMAN is expected to benefit from the improving business outlook for automobiles and higher consumer audio sales.\n\n \n\nIn the second quarter, Samsung Electronics’ capital expenditure reached KRW 9.8 trillion, including KRW 8.6 trillion spent on semiconductors and KRW 0.8 trillion on displays. Total capital expenditure in the first half was KRW 17.1 trillion, including KRW 14.7 trillion for semiconductors and KRW 1.6 trillion for displays.\n\n \n\nInvestment in the Memory Business was spent mainly on equipment for finer process technology and capacity expansion in light of expected growth in memory demand. For the Foundry Business, the Company invested mostly in the advanced 5- and 8nm processes to increase its production capacity.\n\n \n\n \n\nMemory Business Drives Semiconductor Earnings, to Strengthen Cost Competitiveness in H2\nThe Semiconductor businesses posted KRW 18.23 trillion in consolidated revenue and KRW 5.43 trillion in operating profit in the second quarter.\n\n \n\nThe Memory Business saw robust demand for cloud applications related to remote working and online education as the impact from COVID-19 continued, while demand for mobile was relatively weak.\n\n \n\nFor DRAM, datacenter demand increased as a boost in online activities and video conferencing drove demand for server products. Mobile demand was weak due to seasonality and lockdowns related to COVID-19 in parts of the world including the United States and India. For PC, demand remained solid on the back of low-end laptops, while the impact from manufacturing site closures eased in the second quarter.\n\n \n\nFor NAND, server SSD demand continued to grow as new services were introduced by datacenters in the U.S. and as demand for social networking and remote services expanded in China. For mobile, demand remained weak as consumer sentiment was impacted by COVID-19 and as the share of mid- to low-end mobile products rose. For client SSD, demand was robust due to increased production of mid- to low-priced laptops. Overall NAND shipments decreased because of weak mobile demand and a temporary lack of product availability to meet all the demand for some applications.\n\n \n\nLooking to the second half, overall demand for DRAM is expected to pick up from new smartphone launches, while uncertainties remain around geopolitical issues including trade disputes and the pace of higher content-per-box adoption. Likelihood of solid server demand continues in the second half, but server customers’ inventory and investment plans remain to be closely scrutinized. For PC, desktop demand is expected to be weak but low-end laptop demand is likely to remain solid. For graphic, demand will continue to see strong growth with the launch of new game consoles.\n\n \n\nAs for NAND, mobile demand is expected to recover on the back of growing mid- to low-end products despite continuing uncertainties. For server SSD, demand is likely to remain strong as online services and activities increase. Demand for client SSD is expected to decline on weak PC demand, but there is a possibility of a recovery as content-per-box grows toward the end of the year.\n\n \n\nThe Company will focus on flexible product mix and investment, while strengthening the technological leadership in DRAM with the full-fledged application of 1Z-nm and EUV-based products. For NAND, the Company will focus on cost competitiveness and accelerate conversion to 6th-generation V-NAND.\n\n \n\nMeanwhile, earnings for the System LSI Business decreased due to a decline in demand for mobile components including SoCs. However, the Company continued to diversify the business with the launch of big-pixel image sensors with ultra high-speed autofocus features and the ‘CC EAL6+’ certified security chip solution, which provides strong privacy protection in smart devices. The Company also diversified its global customer base and increased the portion of overseas revenue.\n\n \n\nAs for the second half, the number of 5G subscribers and launches of mid- to low-priced 5G smartphones are expected to increase while adoption of high-resolution and triple/quad camera for mobile devices is expected to grow. The Company will seek to expand market opportunities through new products based on its technology leadership.\n\n \n\nThe Foundry Business achieved record quarterly and half-yearly revenue as customers’ inventory build-ups increased. The Company began mass production of 5nm products and is developing 4nm process technology. The Company also strengthened the foundation for expansion by starting investments in production lines in the Pyeongtaek complex.\n\n \n\nIn the second half, while the impact from COVID-19 will persist, the Company plans to mass produce mobile and high-performance computing (HPC) products based on advanced process technology. In addition, the Company plans secure stable sales and improve profitability by diversifying applications beyond mobile products and into HPC and consumer products.\n\n \n\n \n\nDisplay Earnings Improve on One-off Gain; Demand Expected to Recover in H2\nThe Display Panel Business posted KRW 6.72 trillion in consolidated revenue and KRW 0.30 trillion in operating profit for the second quarter. Its earnings improved QoQ thanks to a one-time gain despite weaker demand for overall display panels.\n\n \n\nMobile displays saw unfavorable business conditions persist as the global spread of COVID-19 weighed down smartphone sales globally. For large displays, the operating loss narrowed slightly on increased sales of monitors as more people worked from home.\n\n \n\nLooking ahead to the second half, Samsung expects demand to recover for mobile displays as major customers are planning to launch new products while risks remain due to continuing uncertainties from COVID-19.\n\n \n\nThe Company aims to increase sales and profitability by actively meeting demand from its customers and offering mobile panels with differentiated performance and design. It will also focus on expanding the presence in new applications including displays for foldable phones and other IT devices.\n\n \n\nFor large displays, Samsung will continue to meet demand from its LCD customers until the end of the year and accelerate product development based on new technologies such as QD Displays.\n\n \n\n \n\nMobile Profitability Remains Solid in Q2; Shipments Increase amid Market Competition in Q3\nThe IT & Mobile Communications Division posted KRW 20.75 trillion in consolidated revenue and KRW 1.95 trillion in operating profit for the second quarter.\n\n \n\nAmid lockdowns in regions including North America and Europe and store closures due to the global impact of COVID-19, overall market demand decreased QoQ and the Company’s smartphone shipment and revenue declined from the previous quarter. However, efficient cost management, including reductions of marketing expenses and offline promotions, helped the Company report solid profits.\n\n \n\nLooking ahead to the third quarter, smartphone sales are expected to rise QoQ, backed by a stronger product mix thanks to the launch of new flagship models, including the Galaxy Note and a new foldable phone, to be introduced at the upcoming virtual Galaxy Unpacked event on August 5th.\n\n \n\nFor the second half, the overall mobile market is expected to show a gradual recovery. However, uncertainties related to COVID-19 will continue to persist, with market competition expected to intensify as companies strive to make up for weak performance during the first half.\n\n \n\nAmid increased market uncertainty, the Company will respond timely to recovering demand in various regions by launching new flagship models as well as strengthening its mass-market lineup. It will also continue efforts to enhance profitability through optimizing product portfolio, building on the improvement in profitability in mass market models since last year.\n\n \n\nAs for the Networks Business, investments in 5G services were delayed in both domestic and overseas markets due to the global spread of COVID-19. While there are still uncertainties over network operators’ investment schedules, Samsung will continue to explore new opportunities for business expansion.\n\n \n\n \n\nAppliances, TV Notch Earnings Growth on Premium Products, Supply Chain Management\nThe Consumer Electronics Division, comprised of the Visual Display and Digital Appliances businesses, recorded KRW 10.17 trillion in consolidated revenue and KRW 0.73 trillion in operating profit in the second quarter.\n\n \n\nProfit for the Visual Display Business rose despite softness in sales as the Company sought new sales opportunities online to overcome difficulties sparked by global lockdowns. The Company also boosted profits by using its diverse locations for sales and production and targeting consumers’ needs for smart TVs. As a result, sales in premium products like QLED and ultra-large models grew both QoQ and YoY in the second quarter. Cost reduction as well as operational efficiency also boosted profits in the second quarter.\n\n \n\nThe Digital Appliances Business saw earnings in the second quarter improve both on-quarter and over a year earlier as consumer spending in some economies picked up thanks to an easing of lockdowns in some regions. During this bump in demand in the second quarter, the Company expanded sales of premium products including its Grande AI washers and dryers as well as its Bespoke refrigerators. Seasonal demand for air conditioners on top of cost-effective marketing strategies also helped earnings.\n\n \n\nFor the second half of the year, both TVs and digital appliances are expected to see better performance in sales versus the first half of 2020 once pent-up demand is released after COVID-19 lockdowns ease and year-end holiday spending. Slowdowns in the global economy, rising unemployment and fluctuations in foreign exchange rates will be risks to earnings for the rest of the year, in addition to the ongoing pandemic. The Company will aim to increase profitability going forward through premium product sales and more efficient marketing.\n\n \n\n \n\nEnhancing Shareholder Communication on ESG\nSamsung remains committed to creating environmental and social value to support sustainable growth, and to communicating transparently with shareholders on ESG issues.\n\n \n\nIn Samsung’s 2020 Sustainability Report, the Company enhanced its disclosure of climate actions based on the Taskforce on Climate-related Financial Disclosure framework. In the report, published in June, Samsung also introduced Sustainability Accounting Standards Board standards for the first time to share its actions and developments in sustainable management.",
    "author": "Frank Porcaro",
    "comments": ""
  },
  {
    "noteId": 5,
    "holdingId": 70002293,
    "noteTitle": "Mgmt Meeting - 07/27/20",
    "region": "Asia",
    "country": "South Korea",
    "sector": "Information Technology",
    "noteText": "Samsung Electronics Aiming to Become No. 1 Android AP Maker by Joining Forces with ARM and AMD.  Samsung Electronics is aiming to become the No. 1 player Android application processor (AP) makers with a mobile AP that offers a significantly improved CPU and GPU performance.\n\nThe tech giant has practically given up its strategy of developing a mobile AP on its own and turned to a strategy of partnering with ARM and AMD. As HiSilicon, Huawei's fabless (semiconductor design) subsidiary, is losing competitiveness due to U.S. sanctions, competition among Android AP makers is likely to be a two-runner race between Qualcomm and Samsung Electronics.\n\nSamsung Electronics loaded the Exynos 990 AP on its flagship smartphone Galaxy Note 20 released for consumers in Europe and other regions. The Exynos 990 was also used for the Galaxy S20, which was released in the first half of 2020.\n\nSome experts predicted that Samsung would use the Exynos 992 for the Galaxy Note 20, but it decided to use the Exynos 990. It did not release a new AP because it stopped the development of its own CPU in 2019 and little progress has been made in improving ARM's Mali GPU installed in the Exynos.\n\nSamsung Electronics loaded the Snapdragon 865+, an upgraded version of Qualcomm's Snapdragon 865, on the Galaxy Note 20 released for the Korean, American, Canadian, Japanese, and Chinese markets. The Galaxy S20 used the Snapdragon 865.\n\nSamsung believes that a major contest among AP makers will take place in 2021. It has been working to release a much improved Exynos in 2021.\n\nSamsung Electronics is working with ARM, which is called a fabless company for fabless companies, to develop a new CPU based on Coretex-X Custom. Previously, the Korean semiconductor giant had only purchased instruction set architectures (ISAs) from ARM to design CPUs, but now it is expanding its scope of collaboration with ARM to joint development of CPUs. Compared to its predecessor, Coretex-A, Coretex-X has improved performance by 30 percent.\n\nSamsung Electronics is planning to overcome the Exynos' biggest weakness in GPU through cooperation with AMD. Due to the low-power Mali GPU, the Exynos had heat problems when used for high-performance games. Samsung Electronics is planning to surpass Qualcomm by upgrading the neural processing units (NPUs) and communication modems used for the Exynos. The company is planning to ramp up the number of NPU personnel 10-fold to 2,000 by 2030.",
    "author": "Justin Machata",
    "comments": "author: FP, comment:  is this a significant challenge to apple?"
  }
]